"use client";

import React, {Suspense, useEffect, useState} from "react";
import {marked} from "marked";
import {useSearchParams} from "next/navigation";
import MarkdownRenderer from "@/components/MarkdownRenderer";


interface PlayerProps {

}

const BooksSection: React.FC<PlayerProps> = ({}) => {


    return (
        <Suspense>
        <section
            className="container my-10 mx-auto px-4 py-8 md:py-12 lg:py-16 xl:py-20 2xl:py-24 3xl:py-28 bg-white dark:bg-gray-900"
            id="books-section">
            <div
                className="flex flex-col items-center justify-center w-full mb-8 md:mb-12 lg:mb-16 xl:mb-20 2xl:mb-24 3xl:mb-28">
                <h2 className="text-3xl font-bold text-center dark:text-white text-gray-800 md:text-4xl lg:text-5xl xl:text-6xl 2xl:text-7xl 3xl:text-8xl">
                श्री सदगुरु चालीसा
                </h2>
            </div>
            <div className="text-center">
                <MarkdownRenderer markdown={`
            

### दोहा

तीन लोक चौदह भुवन, दस दिशि चारों धाम।   
श्री सदगुरु सम देव नहिं, जपहूँ सदा तेहिं नाम॥   
श्वास नाम की, आस आपकी, प्यास दरश की होय।   
क्षुधा जाप की, भला दास की, नाश पाप की होय॥     

### चौपाई

आदि अन्त का भेद बखाना।   
सुरति कमल सदगुरु स्थाना॥   

जय सदगुरु जय महाकृपाला।   
सब देवन में देव निराला ॥   

दुःखनाशक जय सुखकर दाता।   
जय सदगुरु मम भाग्य विधाता॥   

सदगुरु आप दीनन हितकारी।   
दुःख भंजना महाउपकारी॥   

सदगुरु सुख संतोष के नायक।   
परमारथ सो सदा सहायका॥   
 
मोह विनाशक तिमिर विनाशक।  
सदगुरु ज्ञान ज्योति प्रकाशक ॥   

गुरु अनन्त गुरु ज्ञान अनन्ता।  
सदगुरु संग अनन्त भए सन्ता॥   

सुमिरत नाम रहेउ आशंका।  
विश्व विदित सदगुरु के डंका॥   

सदगुरु मिले तो संशय भागे।  
संशय बहुरि अंग नहिं लागे॥   


तीन लोक में फिरत अकेला।  
महावीर सदगुरु के चेला॥   

लय बिनु गान, ईश बिनु ध्याना।  
सदगुरु बिन नहिं होवे ज्ञाना॥   

जो करे नित सदगुरु का संगा।  
कबहूँ न पकड़े काल भुजंगा॥   

सदगुरु का जो ध्यान लगावे।  
भूत पिशाच का भय न सतावे॥   

ऐहिं ते अधिक जाई न बरनी।   
सबसे बड़ी सदगुरु की करनी॥   

सदगुरु की जय हो प्रचारक।  
देशभक्त प्रिय जगत सुधारक॥   

दीनदयाल प्रेम की गागर।  
सदगुरु देव करुणा के सागर॥   

कोमल हृदय मधुर अति बैना।  
अनुपम हैं सदगुरु के नैना॥   

जय सदगुरु सत्संग की जय हो।  
नित्य जीवन सदगुरुमय  हो॥   

ध्यान धरत सदगुरु भगवन्ता।  
मिट जाएं सब व्याधि तुरन्ता॥   

काम, क्रोध, मद, लोभ नसावा।  
अहोभाग्य जेहिं सदगुरु पावा ॥   

तन-मन-धन अर्पण तुम पांहि।   
निशदिन बसे मोर मन माहिं॥   

जो सदगुरु को शरण में जावे।  
कालत्रास तेहिं निकट न आवे॥   

आपहिं से पूरित ज्ञान विज्ञाना।   
सकल ब्रह्माण्ड का भेद प्रमाणा॥   

सदगुरु ज्योति स्वरूप प्रकाशा।   
दूर करत घनघोर निराशा॥   

कबहूँ न व्यापत काल की फाँसा।   
सदगुरु पूरी करत अभिलाषा॥   

नयन, शीष, कर, बदन हमारे।   
पल-पल ध्यावे चरण तुम्हारे॥   

सेवे सदा सदगुरु के चरणा।   
परमानन्द सदगुरु की शरणा॥   

सदगुरु के नित दर्शन करहिं।   
जीव सोई भवसागर तरहिं॥   

नाम लेत छूटेहिं भव शूला।   
सदगुरु सकल मुक्ति के मूला॥   

सुन्दर सहज सकल सुख राशी।   
हरि समान घट-घट के वासी॥   

सदगुरु चरणामृत हैं निर्मल।  
सेवा कबहूँ न जाए निष्फल॥   

जा पर कृपा सदगुरु की होई।  
ता पर कृपा करत सब कोई॥   

नहिं चाहत धन धान्य अपारा।  
सदगुरु केवल प्रेम पियारा॥   

गुरुचरणन में तजै अधिमाना।  
सोई जन पावे भक्ति खजाना॥   

सन्त वचन मानहूँ जग माँहि।  
अन्य देव सदूगुरु सम नांहि॥

सदगुरु प्रेम सुधा रस प्याली।   
सदगुरु की महिमा है निराली ॥   

सेवहूँ चरण चरणों पर ध्याना।  
श्री सदगुरु बिन नहिं कल्याणा ॥   

सत्यनाम सदगुरु की पूजा।   
ऐहिंते अधिक कोई धर्म नहिं दूजा ॥   

ध्यान धरत सदगुरुहिं रिझावे।  
निश्चय मोक्ष मुक्ति फल पावे॥    

सदगुरु चालीसा जो नित गावे।   
ते सत्यलोक परम गति पावे ॥   

### **दोहा**
शीश नवाकर विनती करुँ,  
धरूँ चरणन पर ध्यान  
भक्ति, शक्ति मम त्यागमय,  
दीजे कृपानिधान  

--------

### **जाने से पहले कह गए साहिब कबीर**

खुलक मुल्क देखन गया,  
राजा परजा रीत।  

जम्बू दीप जहान में,  
उत्तरा शब्द अतीत ॥    

जम्बू द्वीप, थान बैठाई।  
देही पान तब पंथ चलाई ॥   

कोटि वाणी तिन्ह हम कह दीन्हा।  
जगत जीव कहँ निर्मल कीन्हा ॥  
                
                `}
                />
            </div>
        </section>
            </Suspense>
    );
}

export default BooksSection;